<script setup>
import ProfileCity from '@/assets/images/profile-city.jpg';
import ProfileCity2 from '@/assets/images/profile-city-2.jpg';

const emit = defineEmits(['close'])
const handleClose = () => {
    emit('close')
}
</script>

<template>
    <section class="city">
        <span @click.prevent="handleClose">+</span>
        <div class="city__wrapper">
            <div class="city__wrapper-content">
                <h1>Астрахань</h1>
                <p>
                    Астрахань — древний город на юге России, расположенный на берегу Волги.
                    Город известен своими архитектурными памятниками, среди которых выделяется
                    Астраханский кремль — символ региона, построенный в XVII веке. Здесь также находится
                    знаменитая Храм-памятник Святым Царственным Мученикам, сочетающий в себе религиозную
                    значимость и историческую ценность.

                    Астрахань — важный культурный и экономический центр Юга России. Ежегодно здесь проходят
                    фестивали и мероприятия, привлекающие туристов со всей страны. Помимо истории, город
                    славится живописными парками, такими как Парк культуры и отдыха им. 50-летия Победы,
                    который является любимым местом жителей и гостей города.

                    Рядом с Астраханью расположен крупнейший заповедник России — Баскунчак, где можно увидеть
                    уникальные природные ландшафты, включая озеро Баскунчак — самое большое в мире озеро соль.
                    Также рядом находятся острова Бузулук и Кичик-Бузулук, которые популярны среди любителей
                    отдыха на природе.
                </p>
            </div>
            <div class="city__wrapper-imgs">
                <h2>Фотографии</h2>
                <div>
                    <img :src="ProfileCity" alt="ProfileCity">
                </div>
                <div>
                    <img :src="ProfileCity2" alt="ProfileCity2">
                </div>
            </div>
        </div>
    </section>
</template>